<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads updates for Adobe Acrobat Pro X or XI. MAJOR_VERSION can be '10', '11', corresponding to Pro X,
    Pro XI, etc. You can override this recipe multiple times for different values of MAJOR_VERSION.

VERSION can be a specific update version, ie. '10.1.6', or the
default, 'latest'.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.AdobeAcrobatProXIUpdate</string>
    <key>Input</key>
    <dict>
        <key>MAJOR_VERSION</key>
        <string>11</string>
        <key>NAME</key>
        <string>AdobeAcrobatProX_Update</string>
        <key>TARGET_OS</key>
        <string>10.9</string>
        <key>VERSION</key>
        <string>latest</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>major_version</key>
                <string>%MAJOR_VERSION%</string>
                <key>target_os</key>
                <string>%TARGET_OS%</string>
                <key>version</key>
                <string>%VERSION%</string>
            </dict>
            <key>Processor</key>
            <string>AdobeAcrobatProUpdateInfoProvider</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>